[{
    "articleId": "1",
    "name": "第1篇",
    "kind": "kind",
    "response": "response",
    "time": "time",
    "id": 1,
    "pl": 44,
    "z": 5,
    "content": "For problem one, passing props can be tedious for deeply nested components, and simply doesn't work for sibling components. For problem two, we often find ourselves resorting to solutions such as reaching for direct parent/child instance references or trying to mutate and synchronize multiple copies of the state via events. Both of these patterns are brittle and quickly lead to unmaintainable code.",
    "kind":"html",
    "kind2":"入门学习"

  },
  {
    "articleId": "1",
    "name": "第2篇",
    "kind": "kind",
    "response": "response",
    "time": "time",
    "id": 2,
    "pl": 214,
    "z": 52,
    "content": "This boilerplate is targeted towards large, serious projects and assumes you are somewhat familiar with Webpack and vue-loader. Make sure to also read vue-loader's documentation for common workflow recipes.",
    "kind":"html",
    "kind2":"入门学习"
    

  },
  {
    "articleId": "1",
    "name": "第3篇",
    "kind": "kind",
    "response": "response",
    "time": "time",
    "id": 3,
    "pl": 43,
    "z": 62,
    "content": "This directory holds the actual configurations for both the development server and the production webpack build. Normally you don't need to touch these files unless you want to customize Webpack loaders, in which case you should probably look at build/webpack.base.conf.js.",
    "kind":"html",
    "kind2":"入门学习"


  },
  {
    "articleId": "1",
    "name": "第4篇",
    "kind": "kind",
    "response": "response",
    "time": "time",
    "id": 4,
    "pl": 4,
    "z": 34,
    "content": "This is the template index.html for our single page application. During development and builds, Webpack will generate assets, and the URLs for those generated assets will be automatically injected into this template to render the final HTML.",
    "kind":"html",
    "kind2":"入门学习"


  },
  {
    "articleId": "1",
    "name": "第5篇",
    "kind": "kind",
    "response": "response",
    "time": "time",
    "id": 5,
    "pl": 16,
    "z": 78,
    "content": "However there is a caveat. browserslist recommends defining the target in a common place like package.json or in a .browserslistrc config file. This allows tools like autoprefixer and eslint-plugin-compat to share the config. For this template, browserslist is configured in the package.json",
    "kind":"html",
    "kind2":"入门学习"

  }
]
